In [1]:
import pandas as d

In [2]:
d1=[["ravi",19],["ee",78]]

In [3]:
r=d.DataFrame(d1)

In [4]:
r

      0   1
0  ravi  19
1    ee  78

In [7]:
d.Series(d1)

0    [ravi, 19]
1      [ee, 78]
dtype: object

In [9]:
d.DataFrame(d1,columns=["name","age"],index=["Data1","data2"])

       name  age
Data1  ravi   19
data2    ee   78

In [39]:
s=[{"ravi:":55,"ram":44},{"ravi:":5,"ram":4}]

In [40]:
d.Series(s)

0    {'ravi:': 55, 'ram': 44}
1      {'ravi:': 5, 'ram': 4}
dtype: object

In [51]:
dd=d.DataFrame(s,columns=["ravi:","ram"])

In [52]:
dd

   ravi:  ram
0     55   44
1      5    4

In [56]:
dd.iloc[0
        ,0:2]

ravi:    55
ram      44
Name: 0, dtype: int64

In [57]:
dd.mean()

ravi:    30.0
ram      24.0
dtype: float64

In [58]:
a=d.read_csv("C:\Data.csv")

In [60]:
a

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [61]:
a.mean()

Age          38.777778
Salary    63777.777778
dtype: float64

In [62]:
a.median()

Age          38.0
Salary    61000.0
dtype: float64

In [64]:
import matplotlib

In [65]:
s={"ram":23}

In [66]:
s

{'ram': 23}

In [67]:
s["aa"]=45

In [68]:
s

{'ram': 23, 'aa': 45}

In [76]:
s.sort()

AttributeError: 'dict' object has no attribute 'sort'